# Лаборатоная работа 6
## Задания 
Напишите программу для решения задач своего варианта.
Оформите отчёт в README.md.
## Решение
### Задание 1
Ольга составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Ольга использует 4-буквенные слова, в которых есть только буквы A, B, C, D, X, Y, Z. При этом первая буква кодового слова  — это буква X, Y или Z, а далее в кодовом слове буквы X, Y и Z не встречаются. Сколько различных кодовых слов может использовать Ольга?
```py
first_letter = 3
other_letters = 4
words = (first_letter * (other_letters ** 3))
print (words)
```

### Задание 2
Значение арифметического выражения 9**8+3**5-9 записали в системе счисления с основанием 3. Сколько цифр 2 содержится в этой записи?
```py
number_10 = 9**8 + 3**5 - 9
number_3 = ''
temp = number_10
while temp > 0:
    remainder = temp % 3
    number_3 = str(remainder) + number_3
    temp //= 3
count_of_twos = number_3.count('2')
print(f"Количество цифр 2 в троичной записи: {count_of_twos}")
```

### Задание 3
Найдите все натуральные числа, принадлежащие отрезку [45000000; 50000000], у которых ровно пять различных нечётных делителей (количество чётных делителей может быть любым). Выведите найденные числа в порядке возрастания.
